Catalogs/бит_УслугиЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_УслугиЖКХ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойРежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипыНачислений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыНачисленийПоЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафаОтчетаГЦЖС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ГрафыОтчетаПоГЦЖС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦелевыеСредства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначениеЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДвижениеЦС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДвиженияЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Comment>(Настройка выгрузки льготы)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖСОбщеДом</Name>
					<Comment>(Настройка выгрузки льготы)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС_КПУ</Name>
					<Comment>(Настройка выгрузки льготы)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС_ДПУ</Name>
					<Comment>(Настройка выгрузки льготы)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщедомовыеНачисления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>нвл_ИспользоватьТариф</Name>
					<Comment>(Настройка выгрузки льготы)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодГИСЖКХ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеГИСЖКХ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>лб_ГруппаУслугДляПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ГруппыУслугДляПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поставщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпособыРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РежимыПотребленияУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РежимПотребленияУслуг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/бит_СтавкиНаУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СтавкиНаУслуги</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлановаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СверхНормативнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛьготнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ТарифныеГруппыПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияПоУслугамЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияПоУслугамЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_СпособыРасчетаПоУслугам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_СпособыРасчетаПоУслугам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоГрупповымСчетчикам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоГрупповымСчетчикамСНаличиемИндивидуальных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЕдиницамПотребленияНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЕдиницамПотребления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЖилойПлощади</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоИндивидуальнымСчетчикам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОбщейПлощади</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОтапливаемойПлощади</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПроживающим</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПроживающимСНормативом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРаспределению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетПоСчетчикам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_УслугиЖКХ/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура устанавливает отборы.
//
&НаКлиенте
Процедура УстановитьОтборы()
	
	СтавкиНаУслуги.Отбор.Элементы.Очистить();
	
	Попытка
		Если мКэшЗначений.ЭтоНовый = Ложь Тогда
			
			НормыУслуг.Отбор.Элементы.Очистить();
			НормыУслуг.Отбор.Элементы[0].ПравоеЗначение   = Объект.Ссылка;
			
		КонецЕсли;	
		
	Исключение
	КонецПопытки;
	
	Эл = ЭтаФорма.НормыУслуг.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Услуга");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = Объект.Ссылка;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	Эл = ЭтаФорма.СтавкиНаУслуги.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Услуга");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = Объект.Ссылка;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры	

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	КэшированныеЗначения.Вставить("РежимПотребленияПустаяСсылка", Справочники.бит_РежимыПотребленияУслуг.ПустаяСсылка());
	
	КэшированныеЗначения.Вставить("СпособРасчетаПустаяСсылка"   , Перечисления.бит_СпособыРасчетаПоУслугам.ПустаяСсылка());
	
	КэшированныеЗначения.Вставить("ЭтоНовый"   , ?(Параметры.Ключ.Пустая(), Истина, Ложь));
	
КонецПроцедуры

// Функция получает ТипОбъекта на сервере.
//
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("СправочникОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции // ПолучитьТипОбъекта()

// Процедура получает объект из данных формы и записывает объект.
//
&НаСервере
Процедура ЗаписатьОбъект(Параметр)
	
	СправочникОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	СправочникОбъект.ПроверятьРежимПотребления = Параметр;
	
	Попытка
		
		СправочникОбъект.Записать();
		
		мКэшЗначений.ЭтоНовый = Ложь;
		
	Исключение
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не удалось записать объект """ + СправочникОбъект + """!
		|" + ОписаниеОшибки();
		Сообщение.Сообщить();
		
	КонецПопытки;
	
	ЗначениеВДанныеФормы(СправочникОбъект, Объект);
	
КонецПроцедуры

&НаСервере
// Функция определяет возможность удаления или изменения в табличной части одного поставщика на другой.
// Параметры:
//	Поставщик - поставщик, ссылки на который надо проверить.
// Возвращаемое значение:
//	булево, истина - удалять/изменять можно.
Функция ОпределитьВозможностьУдаленияПоставщика(Поставщик)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_СтавкиНаУслугиСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	|			,
	|			Услуга = &Услуга
	|				И Поставщик = &Поставщик) КАК бит_СтавкиНаУслугиСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.Период
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			,
	|			Услуга = &Услуга
	|				И Поставщик = &Поставщик) КАК бит_СведенияПоУслугамЛССрезПоследних";
	Запрос.УстановитьПараметр("Услуга", Объект.Ссылка);
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

// Функция определяет возможность удаления или изменения в табличной части одного способа расчета на другой.
// Параметры:
//	СпособРасчета - способ расчета, ссылки на который надо проверить.
// Возвращаемое значение:
//	булево, истина - удалять/изменять можно.
&НаСервере
Функция ОпределитьВозможностьУдаленияСпособаРасчета(СпособРасчета)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_НормыНаУслугиСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.бит_НормыНаУслуги.СрезПоследних(
	|			,
	|			Услуга = &Услуга
	|				И СпособРасчетаПоУслуге = &СпособРасчета) КАК бит_НормыНаУслугиСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_СтавкиНаУслугиСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	|			,
	|			Услуга = &Услуга
	|				И СпособРасчета = &СпособРасчета) КАК бит_СтавкиНаУслугиСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.Период
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			,
	|			Услуга = &Услуга
	|				И СпособРасчета = &СпособРасчета) КАК бит_СведенияПоУслугамЛССрезПоследних";
	Запрос.УстановитьПараметр("Услуга", Объект.Ссылка);
	Запрос.УстановитьПараметр("СпособРасчета", СпособРасчета);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаСервере
// Функция определеяет возможность удаления режима потребеления.
//
Функция ОпределитьВозможностьУдаленияРежимПотребления(РежимПотребления)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_НормыНаУслугиСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.бит_НормыНаУслуги.СрезПоследних(
	|			,
	|			Услуга = &Услуга
	|				И РежимПотребления = &РежимПотребления) КАК бит_НормыНаУслугиСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_СтавкиНаУслугиСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(
	|			,
	|			Услуга = &Услуга
	|				И РежимПотребления = &РежимПотребления) КАК бит_СтавкиНаУслугиСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.Период
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			,
	|			Услуга = &Услуга
	|				И РежимПотребления = &РежимПотребления) КАК бит_СведенияПоУслугамЛССрезПоследних";
	Запрос.УстановитьПараметр("Услуга", Объект.Ссылка);
	Запрос.УстановитьПараметр("РежимПотребления", РежимПотребления);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	СправочникОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.бит_УслугиЖКХ"));
	// Вызов механизма разделения прав доступа
	бит_ПраваДоступа.ПередОткрытиемФормы(Отказ,СтандартнаяОбработка,СправочникОбъект,ЭтаФорма);	
	
	//АПК пункт 4 https://its.1c.ru/db/v8std/content/737/hdoc
	Элементы.Файлы.Доступность = РольДоступна("ПолныеПрава");
	
	Если Объект.Ссылка = ПредопределенноеЗначение("Справочник.бит_УслугиЖКХ.Пеня") Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Услуга ""Пеня"" не редактируется.";
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли; 
	ЗначениеВДанныеФормы(СправочникОбъект,Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборы();
	
	// Выделяем основной способ расчета
	Для каждого Строка Из Объект.СпособыРасчета Цикл
		
		Если Объект.ОсновнойСпособРасчета <> Неопределено Тогда
			
			Если Объект.ОсновнойСпособРасчета = Строка.СпособРасчета Тогда
				
				Строка.Основной          = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	// Выделяем основной Режим потребления
	Для каждого Строка Из Объект.РежимыПотребленияУслуг Цикл
		
		Если Объект.ОсновнойРежимПотребления <> Неопределено Тогда
			
			Если Объект.ОсновнойРежимПотребления = Строка.РежимПотребленияУслуг Тогда
				
				Строка.Основной          = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	мКэшЗначений.ЭтоНовый = Ложь;
	
	УстановитьОтборы();
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки "Файлы" коммандной панели формы. 
////
&НаКлиенте
Процедура Файлы(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ФайлыЗавершение", ЭтотОбъект), "Сначала запишите документ.");
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Объект", Объект.Ссылка);
	
	ОткрытьФорму("Справочник.бит_рз_ХранилищеДополнительнойИнформации.Форма.ФормаСпискаУправляемая", Новый Структура("ЗаполнитьИзСправочникаУслугиЖКХ", ПараметрыФормы), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыЗавершение(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события "ПриИзменении" поля ввода Наименование.
//
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.НаименованиеПолное) тогда
		Объект.НаименованиеПолное      = Объект.Наименование;
		Объект.НаименованиеСокращенное = Лев(Объект.Наименование, 12);
	КонецЕсли;  
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийКомандныхПанелейФормы

// Процедура - обработчик события "Нажатие" кнопки "Основной" командной панели СпособыРасчета.
//
&НаКлиенте
Процедура Основной(Команда)
	
	ТекущаяСтрока = Элементы.СпособыРасчета.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Если  ТекущаяСтрока.СпособРасчета =  ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоРаспределению") Тогда
			
			ПоказатьПредупреждение(Новый ОписаниеОповещения("ОсновнойЗавершение1", ЭтотОбъект), "Способ расчета ""По Распределению"" не может быть основным");	
			
		ИначеЕсли  ТекущаяСтрока.СпособРасчета = ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам")  Тогда
			
			ПоказатьПредупреждение(Новый ОписаниеОповещения("ОсновнойЗавершение", ЭтотОбъект), "Способ расчета ""По счетчикам"" не может быть основным");	
			
		Иначе
			Для каждого Строка Из Объект.СпособыРасчета Цикл
				
				Строка.Основной = Ложь;
				
			КонецЦикла; 
			
			Объект.ОсновнойСпособРасчета = ТекущаяСтрока.СпособРасчета;
			
			ТекущаяСтрока.Основной          = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойЗавершение1(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойЗавершение(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки "Основной" командной панели РежимыПотребленияУслуг.
//
&НаКлиенте
Процедура ОсновнойРежим(Команда)
	
	ТекущаяСтрока = Элементы.РежимыПотребленияУслуг.ТекущиеДанные;
	
	Для каждого Строка Из Объект.РежимыПотребленияУслуг Цикл
		
		Строка.Основной = Ложь;
		
	КонецЦикла; 
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Объект.ОсновнойРежимПотребления = ТекущаяСтрока.РежимПотребленияУслуг;
		ТекущаяСтрока.Основной          = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки "Добавить" командной панели НормыНаУслуги.
//
&НаКлиенте
Процедура Добавить(Команда)
	
	Если мКэшЗначений.ЭтоНовый Тогда
		
		Отказ = Истина;
		
		ПоказатьПредупреждение(Новый ОписаниеОповещения("НормыУслугПередНачаломДобавленияЗавершение", ЭтотОбъект), "Сначала сохраните справочник");	
		
	Иначе 
		
		УстановитьОтборы();	
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Услуга",Объект.Ссылка);
		ПараметрыФормы.Вставить("Период",ТекущаяДата());
		ФормаОткрытия = ОткрытьФорму("РегистрСведений.бит_НормыНаУслуги.Форма.ФормаЗаписиУправляемая",Новый Структура("ЗаполнитьИзСправочникаУслугиЖКХ", ПараметрыФормы),ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки "Обновить" командной панели НормыНаУслуги.
//
&НаКлиенте
Процедура Обновить(Команда)
	УстановитьОтборы();
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляСпособыРасчета

// Процедура - обработчик события "ПередУдалением" табличного поля Способы расчета.
//
&НаКлиенте
Процедура СпособыРасчетаПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.СпособыРасчета.ТекущиеДанные;
	СпособРасчета  = ТекущаяСтрока.СпособРасчета;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	УдалениеРазрешено = Истина;
	
	Отбор = Новый Структура("СпособРасчета", ТекущаяСтрока.СпособРасчета);
	
	Строки = Объект.СпособыРасчета.НайтиСтроки(Отбор);
	
	Если Строки.Количество() <= 1 Тогда
		
		УдалениеРазрешено = ОпределитьВозможностьУдаленияСпособаРасчета(ТекущаяСтрока.СпособРасчета);	
		
	КонецЕсли; 
	
	Если НЕ УдалениеРазрешено Тогда
		Отказ = Истина;

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Существуют документы проведенные по способу расчета <"+ТекущаяСтрока.СпособРасчета+">!
		|Удаление текущего способа расчета невозможно.");
		
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока <> Неопределено Тогда 
		Если ТекущаяСтрока.СпособРасчета = Объект.ОсновнойСпособРасчета И Строки.Количество() <= 1 Тогда
			Объект.ОсновнойСпособРасчета = мКэшЗначений.СпособРасчетаПустаяСсылка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//  Процедура - обработчик события "НачалоВыбораИзСписка" поля ввода "СпособРасчета",
//  Табличного поля "СпособыРасчета".
//
&НаКлиенте
Процедура СпособыРасчетаСпособРасчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокПеречисления = Новый СписокЗначений;
	
	ТекущиеДанные = Элементы.СпособыРасчета.ТекущиеДанные;
	
	Если ТекущиеДанные.Основной Тогда
		
		СписокПеречисления.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоПроживающим"));
		// БИТ_ЖКХ 16.05.2017 11:47:34 Начало правки...
		СписокПеречисления.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоПроживающимСНормативом"));
		// БИТ_ЖКХ 16.05.2017 11:47:34 Конец правки.
		СписокПеречисления.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади"));
		СписокПеречисления.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади"));
		СписокПеречисления.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади"));
		СписокПеречисления.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления"));
		СписокПеречисления.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет"));
		
		ВыбранныйЭлемент = Неопределено;
		
		
		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("СпособыРасчетаСпособРасчетаНачалоВыбораЗавершение1", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные)), СписокПеречисления, Элементы.СпособыРасчетаСпособРасчета);
		
	Иначе
		СписокПеречисления.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам"));
		СписокПеречисления.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоПроживающим"));
		// БИТ_ЖКХ 16.05.2017 11:47:48 Начало правки...
		СписокПеречисления.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоПроживающимСНормативом"));
		// БИТ_ЖКХ 16.05.2017 11:47:48 Конец правки.
		СписокПеречисления.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоОбщейПлощади"));
		СписокПеречисления.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоЖилойПлощади"));
		СписокПеречисления.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоОтапливаемойПлощади"));
		СписокПеречисления.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления"));
		СписокПеречисления.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребленияНаЛицевойСчет"));
		СписокПеречисления.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоРаспределению"));
		
		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("СпособыРасчетаСпособРасчетаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные)), СписокПеречисления, Элементы.СпособыРасчетаСпособРасчета);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособыРасчетаСпособРасчетаНачалоВыбораЗавершение1(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	ВыбранныйЭлемент = ВыбранныйЭлемент1;
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		
		УдалениеРазрешено = Истина;
		
		Если ТекущиеДанные.СпособРасчета <> ВыбранныйЭлемент.Значение Тогда
			
			Отбор = Новый Структура("СпособРасчета", ТекущиеДанные.СпособРасчета); 
			Строки = Объект.СпособыРасчета.НайтиСтроки(Отбор);
			
			Если ТекущиеДанные.СпособРасчета <> ВыбранныйЭлемент.Значение Тогда
				
				Если Строки.Количество() <= 1 Тогда
					УдалениеРазрешено = ОпределитьВозможностьУдаленияСпособаРасчета(ТекущиеДанные.СпособРасчета);
				КонецЕсли;
				
				Если НЕ УдалениеРазрешено Тогда

					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Существуют документы проведенные по способу расчета <"+ТекущиеДанные.СпособРасчета+">!
					|Изменение выбранного способа расчета не возможно.";
					Сообщение.Сообщить();
					
					Возврат;
				Иначе
					Для каждого Строка Из Объект.СпособыРасчета Цикл
						
						Строка.Основной = Ложь;
						
					КонецЦикла; 
					
					ТекущиеДанные.СпособРасчета = ВыбранныйЭлемент.Значение;
					
					Объект.ОсновнойСпособРасчета = ТекущиеДанные.СпособРасчета;
					
					ТекущиеДанные.Основной          = Истина;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособыРасчетаСпособРасчетаНачалоВыбораЗавершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	ВыбранныйЭлемент = ВыбранныйЭлемент1;
	Если ВыбранныйЭлемент <> Неопределено Тогда
		
		УдалениеРазрешено = Истина;
		
		Если ТекущиеДанные.СпособРасчета <> ВыбранныйЭлемент.Значение Тогда
			
			Отбор = Новый Структура("СпособРасчета", ТекущиеДанные.СпособРасчета); 
			Строки = Объект.СпособыРасчета.НайтиСтроки(Отбор);
			
			Если ТекущиеДанные.СпособРасчета <> ВыбранныйЭлемент.Значение Тогда
				
				Если Строки.Количество() <= 1 Тогда
					УдалениеРазрешено = ОпределитьВозможностьУдаленияСпособаРасчета(ТекущиеДанные.СпособРасчета);
				КонецЕсли;
				
				Если НЕ УдалениеРазрешено Тогда
					
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Существуют документы проведенные по способу расчета <"+ТекущиеДанные.СпособРасчета+">!
					|Изменение выбранного способа расчета не возможно.";
					Сообщение.Сообщить();
					
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
			ТекущиеДанные.СпособРасчета = ВыбранныйЭлемент.Значение;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаВыбора" поля ввода СпособРасчета табличного поля Способы расчета.
//
&НаКлиенте
Процедура СпособыРасчетаСпособРасчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УдалениеРазрешено = Истина;
	
	Отбор = Новый Структура("СпособРасчета", Элемент.Значение); 
	Строки = Объект.СпособыРасчета.НайтиСтроки(Отбор);
	
	Если Элемент.Значение <> ВыбранноеЗначение Тогда
		
		Если Строки.Количество() <= 1 Тогда
			УдалениеРазрешено = ОпределитьВозможностьУдаленияСпособаРасчета(Элемент.Значение);
		КонецЕсли;
		
		Если НЕ УдалениеРазрешено Тогда
			СтандартнаяОбработка = Ложь;
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Существуют документы проведенные по способу расчета <"+Элемент.СпособРасчета+">!
			|Изменение выбранного способа расчета не возможно.";
			Сообщение.Сообщить();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляПоставщики

// Процедура - обработчик события "ПередУдалением" табличного поля ПоставщикиУслуг.
//
&НаКлиенте
Процедура ПоставщикиПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.Поставщики.ТекущиеДанные;
	
	// Запретим удалять Поставщика если он когда либо использовался
	УдалениеРазрешено = Истина;
	
	Отбор = Новый Структура("Поставщик", ТекущаяСтрока.Поставщик);
	
	Строки = Объект.Поставщики.НайтиСтроки(Отбор);
	
	Если Строки.Количество() <= 1 Тогда
		
		УдалениеРазрешено = ОпределитьВозможностьУдаленияПоставщика(ТекущаяСтрока.Поставщик);	
		
	КонецЕсли; 
	
	Если НЕ УдалениеРазрешено Тогда
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Существуют документы проведенные по поставщику <"+ТекущаяСтрока.Поставщик+">!
		|Удаление текущего поставщика не возможно.";
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаВыбора" табличного поля ПоставщикиУслуг
//
&НаКлиенте
Процедура ПоставщикиПоставщикОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Элементы.Поставщики.ТекущиеДанные.Поставщик <> ВыбранноеЗначение Тогда
		УдалениеРазрешено = ОпределитьВозможностьУдаленияПоставщика(Элементы.Поставщики.ТекущиеДанные.Поставщик);
		Если НЕ УдалениеРазрешено Тогда
			СтандартнаяОбработка = Ложь;
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Существуют документы проведенные по поставщику <"+Элемент.ТекстРедактирования+">!
			|Изменение выбранного поставщика не возможно.";
			Сообщение.Сообщить();
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляРежимыПотребления

// Процедура - обработчик события "ПередНачаломДобавления" табличного поля РежимыПотребления.
//
&НаКлиенте
Процедура РежимыПотребленияУслугПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если мКэшЗначений.ЭтоНовый Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("РежимыПотребленияУслугПередНачаломДобавленияЗавершение", ЭтотОбъект, Новый Структура("Отказ", Отказ)), "Элемент еще не записан. Записать?", РежимДиалогаВопрос.ОКОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимыПотребленияУслугПередНачаломДобавленияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Отказ = ДополнительныеПараметры.Отказ;
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		Попытка
			ЗаписатьОбъект(Ложь);
		Исключение
			// Не заполнены обязательные реквизиты
			Отказ = Истина;
		КонецПопытки;
		
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПередУдалением" табличного поля РежимыПотребления.
//
&НаКлиенте
Процедура РежимыПотребленияУслугПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.РежимыПотребленияУслуг.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	УдалениеРазрешено = Истина;
	
	Отбор = Новый Структура("РежимПотребленияУслуг", ТекущаяСтрока.РежимПотребленияУслуг);
	
	Строки = Объект.РежимыПотребленияУслуг.НайтиСтроки(Отбор);
	
	Если Строки.Количество() <= 1 Тогда
		
		УдалениеРазрешено = ОпределитьВозможностьУдаленияРежимПотребления(ТекущаяСтрока.РежимПотребленияУслуг);	
		
	КонецЕсли; 	
	
	Если НЕ УдалениеРазрешено Тогда
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Существуют документы проведенные по режиму потребления <"+ТекущаяСтрока.РежимПотребленияУслуг+">!
		|Удаление не возможно.";
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока.РежимПотребленияУслуг = Объект.ОсновнойРежимПотребления и Строки.Количество() <= 1 Тогда
		Объект.ОсновнойРежимПотребления = мКэшЗначений.РежимПотребленияПустаяСсылка;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляНормыУслуг

// Процедура - обработчик события "ПередНачаломДобавления" табличного поля НормыУслуг.
//
&НаКлиенте
Процедура НормыУслугПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если мКэшЗначений.ЭтоНовый Тогда
		
		Отказ = Истина;
		
		ПоказатьПредупреждение(Новый ОписаниеОповещения("НормыУслугПередНачаломДобавленияЗавершение", ЭтотОбъект), "Сначала сохраните справочник");	
		
	Иначе 
		
		УстановитьОтборы();	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НормыУслугПередНачаломДобавленияЗавершение(ДополнительныеПараметры) Экспорт
	
	УстановитьОтборы();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляСтавкиНаУслуги

//  Процедура - обработчик события "Выбор" табличного поля "СтавкиНаУслуги".
//
&НаКлиенте
Процедура СтавкиНаУслугиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбраннаяСтрока <> Неопределено тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("УслугаВладелец"   , Элемент.ТекущиеДанные.Услуга);
		
		НоваяФорма = ОткрытьФорму("Документ.бит_УстановкаСтавокПоУслугам.Форма.ФормаДокументаУправляемая", Новый Структура("Ключ", ВыбраннаяСтрока), Элемент);
		
		НоваяФорма.УслугаВладелец = Объект.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПередНачаломДобавления" табличного поля СтавкиНаУслуги.
//
&НаКлиенте
Процедура СтавкиНаУслугиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если мКэшЗначений.ЭтоНовый Тогда
		Отказ = Истина;

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Сначала сохраните справочник");
		
		Возврат;
		УстановитьОтборы();				
	Иначе 
		УстановитьОтборы();	
	КонецЕсли;
	
	Если Не Копирование тогда	
		Отказ = Истина;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("УслугаВладелец"   , Объект.Ссылка);
		
		НоваяФорма = ОткрытьФорму("Документ.бит_УстановкаСтавокПоУслугам.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзСправочникаУслугиЖКХ",ПараметрыФормы), Элемент);
		НоваяФорма.УслугаВладелец = Объект.Ссылка;	
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
